marius9043/STM32G431CB_FDCAN/meFDCAN.h
#pragma once

#include <arduino.h>
#include "stm32g4xx_hal.h"
#include "stm32g4xx_hal_fdcan.h"
#define PROC_G4 340

#ifdef STM32G4xx
#define _SERIES PROC_G4
#endif

/**
 * @brief   Initialize the FDCAN module
 *
 * @param   bitrate  The desired bitrate for the FDCAN module (default = 125)
 * @param   canPort  The port number for the FDCAN module (default = 1)
 * @param   rxPin    The pin number for the receive pin (default = PA11)
 * @param   txPin    The pin number for the transmit pin (default = PA12)
 *
 * @return  true if the initialization was successful, false otherwise
 */

bool meFDCAN_init(int bitrate = 125, int canPort = 1, int rxPin = PA11, int txPin = PA12);

/**
 * @brief   Transmit data over the FDCAN module
 *
 * @param   txId     The ID for the transmission
 * @param   txData   The data to be transmitted
 * @param   canPort  The port number for the FDCAN module (default = 1)
 * @param   len      The length of the data to be transmitted (default = 8)
 *
 * @return  true if the transmission was successful, false otherwise
 */

bool meFDCAN_transmit(int txId, uint8_t *txData, int canPort = 1, int len = 8);

/**
 * @brief   Receive data over the FDCAN module
 *
 * @param   id        The ID of the received data
 * @param   len       The length of the received data
 * @param   rxData    The received data
 * @param   canPort   The port number for the FDCAN module (default = 1)
 * @param   type      The type of the received message (default = nullptr)
 * @param   fifo      The FIFO number to use for receiving (default = 0)
 *
 * @return  The index of the received data
 */

int meFDCAN_receive(uint32_t *id, uint8_t *len, uint8_t rxData[], int canPort = 1, int *type = nullptr, int fifo = 0);

/**
 * @brief   Set the receive interrupt for the FDCAN module
 *
 * @param   canPort  The port number for the FDCAN module (default = 1)
 * @param   fifo     The FIFO number to use for the interrupt (default = 0)
 *
 * @return  true if the setting of the receive interrupt was successful, false otherwise
 */

bool me_FDCAN_setRxInterrupt(int canPort = 1, int fifo = 0);

/**
    @brief Add a filter for the FDCAN module
    @param id1 The first ID for the filter
    @param id2 The second ID for the filter
    @param filtertype The type of the filter  (default = FDCAN_FILTER_RANGE)
    (options: FDCAN_FILTER_RANGE, FDCAN_FILTER_DUAL, FDCAN_FILTER_MASK)
    @param canPort The port number for the FDCAN module (default = 1)
    @return The index of the added filter
*/

int me_FDCAN_addFilter(uint32_t id1, uint32_t id2, uint32_t filtertype = FDCAN_FILTER_RANGE, int canPort = 1);

//------------   END of User Functions ----------

/*
 *      Bir Rate Parameters - CAN Controller
 *

//-- http://www.bittiming.can-wiki.info/


/**
 * @brief   Struct to hold the bit rate settings for the CAN bus
 *
 * Clock:     The clock frequency for the CAN bus (MHz)
 * bitrate:   The desired bit rate for the CAN bus (kHz)
 * prescale:  The prescaler value for the CAN bus
 * Seg1:      The segment 1 value for the CAN bus
 * Seg2:      The segment 2 value for the CAN bus
 */

struct bitRateSetting
{
  int Clock;
  int bitrate;
  int prescale;
  int Seg1;
  int Seg2;
};

/**
 * @brief   Global variable to hold the current bit rate setting for the CAN bus
 */
static bitRateSetting canSetting;

/**
 * @brief   Array of bit rate settings for the CAN bus
 */
bitRateSetting brSettings[] = {
    {150, 50, 12, 218, 31},
    {150, 125, 40, 25, 4},
    {150, 250, 3, 174, 25},
    {150, 500, 2, 130, 19},
    {150, 1000, 1, 130, 19},
    {170, 125, 85, 13, 2}};

static FDCAN_HandleTypeDef hfdcan1;
// static FDCAN_HandleTypeDef hfdcan2;
// static FDCAN_HandleTypeDef hfdcan3;

struct meFDCAN_stdFilter
{
  bool filter;
  uint32_t filterindex;
  uint32_t filtertype;
  uint32_t id1;
  uint32_t id2;
};

class Filter
{
public:
  meFDCAN_stdFilter stdfilters[18];
  bool filtered;

  int addFilter(meFDCAN_stdFilter filter)
  {
    int i = returnNextFilterIndex();
    if (i >= 0 && i < 18)
    {
      filtered = true;
      stdfilters[i].filter = true;
      stdfilters[i].filterindex = NewFilterIndex;
      stdfilters[i].filtertype = filter.filtertype;
      stdfilters[i].id1 = filter.id1;
      stdfilters[i].id2 = filter.id2;
      NewFilterIndex++;
      return index;
    }
    else
    {
      return -1;
    }
  }
  int returnNextFilterIndex()
  {
    for (int i = 0; i < 18; i++)
    {
      if (!stdfilters[i].filter)
      {
        return i;
      }
    }
    return -1;
  }
  Filter()
  {
    index = 0;
    NewFilterIndex = 0;
    filtered = false;
    for (int i = 0; i < 18; i++)
    {
      stdfilters[i].filter = false;
    }
  }

  void startFilter()
  {
    index = 0;
  }

  meFDCAN_stdFilter nextFilter()
  {
    if (index >= 0 && index < 18 && stdfilters[index].filter)
    {
      meFDCAN_stdFilter currentFilter = stdfilters[index];
      index++;
      return currentFilter;
    }
    else
    {
      return meFDCAN_stdFilter();
    }
  }

private:
  int index;               //-- index of next filter to send
  uint32_t NewFilterIndex; //-- used when Adding new Filter

}; //---- END class Filter

class Filters
{
public:
  Filter filter[3];

  bool isFilter(int canPort)
  {
    if (canPort >= 1 && canPort <= 3)
      return filter[canPort - 1].filtered;
  }
  int addFilter(int canPort, meFDCAN_stdFilter newfilter)
  {
    if (canPort >= 1 && canPort <= 3)
      return filter[canPort - 1].addFilter(newfilter);
    else
      return -1;
  }
  void startFilter(int canPort)
  {
    if (canPort >= 1 && canPort <= 3)
      filter[canPort - 1].startFilter();
    // else
    //  error handling code here
  }

  meFDCAN_stdFilter nextFilter(int canPort)
  {
    if (canPort >= 1 && canPort <= 3)
      return filter[canPort - 1].nextFilter();
    // else
    //  error handling code here
  }
}; //----- END of class Filters

Filters canFilters;

static bool setupFDCANpin(int);
static int findCanSettings(int, int);
static FDCAN_HandleTypeDef *canPortHandle(int);
static uint32_t int_to_fdcan_dlc(int);
static uint8_t rxDataLength(uint32_t);
static bool meFDCAN_setupFilters(int);
static bool meFDCAN_addConfigFilter(int canPort, meFDCAN_stdFilter *mefilter);
static uint8_t rxDataLengthFD(uint32_t _data_length, bool FD = false);

/*******************************************************
 *
 *            CAN INIT
 *
 *******************************************************/

bool meFDCAN_init(int bitrate, int canPort, int rxPin, int txPin)
{
  FDCAN_HandleTypeDef *fdcan;
  switch (canPort)
  {
  case 1:
    hfdcan1.Instance = FDCAN1;
    fdcan = &hfdcan1;
    break;
  // case 2:
  //   hfdcan2.Instance = FDCAN2;
  //   fdcan = &hfdcan2;
  //   break;
  // case 3:
  //   hfdcan3.Instance = FDCAN3;
  //   fdcan = &hfdcan3;
  //   break;
  default:
    Serial1.println("meFDCAN_init: Invalid CAN Port.");
    return (false);
    break;
  }
  bool success = true;

