marius9043/STM32G431CB_FDCAN/meFDCAN.h
  RCC_PeriphCLKInitTypeDef periphClkInit = {};
  HAL_RCCEx_GetPeriphCLKConfig(&periphClkInit);

  // Initializes the peripherals clocks
  periphClkInit.PeriphClockSelection |= RCC_PERIPHCLK_FDCAN;
  periphClkInit.FdcanClockSelection = RCC_FDCANCLKSOURCE_PCLK1;
  if (HAL_RCCEx_PeriphCLKConfig(&periphClkInit) != HAL_OK)
  {
    // Error_Handler();
    Serial1.println("meFDCAN_init: HAL_RCCEx_PeriphCLKConfig FAIL");
    return (false);
  }
  Serial1.println("meFDCAN_init: PeriphCLKConfig OK");

  // Peripheral clock enable
  __HAL_RCC_FDCAN_CLK_ENABLE();
  //__HAL_RCC_GPIOB_CLK_ENABLE();
  if (!setupFDCANpin(rxPin))
  {
    Serial1.println("meFDCAN_init: RX Pin setup FAIL");
    return (false);
  }
  Serial1.println("meFDCAN_init: RX Pin setup OK");
  // if (!setupFDCANpin(rxPin))
  //   Serial1.println("meFDCAN_init: RX Pin setup FAIL"); // Add this
  // return (false);
  // Serial1.println("meFDCAN_init: RX Pin setup OK"); // Add this

  if (!setupFDCANpin(txPin))
  {                                                     // This is for the TX pin (PB9)
    Serial1.println("meFDCAN_init: TX Pin setup FAIL"); // <--- Make sure this is present
    return (false);
  }
  Serial1.println("meFDCAN_init: TX Pin setup OK");

  // if (!setupFDCANpin(txPin))
  //   Serial1.println("meFDCAN_init: TX Pin setup FAIL"); // Add this
  // return (false);
  // Serial1.println("meFDCAN_init: TX Pin setup OK"); // Add this

  FDCAN_InitTypeDef *init = &fdcan->Init;

  init->ClockDivider = FDCAN_CLOCK_DIV1;
  init->FrameFormat = FDCAN_FRAME_CLASSIC; // FDCAN_FRAME_FD_BRS; FDCAN_FRAME_FD_NO_BRS
  init->Mode = FDCAN_MODE_NORMAL;
  // init->Mode = FDCAN_MODE_EXTERNAL_LOOPBACK;
  init->AutoRetransmission = DISABLE;
  // init->AutoRetransmission = ENABLE;
  init->TransmitPause = ENABLE;
  // init->TransmitPause = DISABLE;
  init->ProtocolException = DISABLE;

  int canClock;
  uint32_t pclk1_frequency = HAL_RCC_GetPCLK1Freq();
  canClock = (int)pclk1_frequency / 1000000;
  Serial1.print("PCLK1 Frequency (MHz): ");
  Serial1.println(canClock); // Add this

  int index = findCanSettings(canClock, bitrate);
  if (index < 0)
  {
    Serial1.println("meFDCAN_init: CAN settings not found."); // <--- Make sure this is present
    return false;
  }
  Serial1.println("meFDCAN_init: CAN settings found.");

  // int index = findCanSettings(canClock, bitrate);
  // if (index < 0)
  //   Serial1.println("meFDCAN_init: CAN settings not found."); // Add this
  // return false;
  // Serial1.println("meFDCAN_init: CAN settings found."); // Add this

  /* Configure the CAN peripheral */

  init->NominalSyncJumpWidth = 1;

  init->NominalPrescaler = canSetting.prescale;
  init->NominalTimeSeg1 = canSetting.Seg1;
  init->NominalTimeSeg2 = canSetting.Seg2;
  //--- not used in Normal
  init->DataPrescaler = canSetting.prescale;
  ;
  init->DataSyncJumpWidth = 1;
  init->DataTimeSeg1 = canSetting.Seg1;
  init->DataTimeSeg2 = canSetting.Seg2;
  //-----
  init->StdFiltersNbr = 18;
  init->ExtFiltersNbr = 0;
  init->TxFifoQueueMode = FDCAN_TX_FIFO_OPERATION;
  if (HAL_FDCAN_Init(fdcan) != HAL_OK)
  {
    Serial1.println("meFDCAN_init: HAL_FDCAN_Init FAIL"); // Modified existing
    return (false);
  }
  Serial1.println("meFDCAN_init: HAL_FDCAN_Init OK"); // Add this

  //----------  Filters Setup
  // meFDCAN_setupFilters(canPort);
  if (!meFDCAN_setupFilters(canPort))
  {
    Serial1.println("meFDCAN_init: Filter setup FAIL"); // Add this
    return (false);
  }
  Serial1.println("meFDCAN_init: Filter setup OK"); // Add this

  if (HAL_FDCAN_Start(fdcan) != HAL_OK)
  {
    Serial1.println("meFDCAN_init: HAL_FDCAN_Start FAIL"); // Modified existing
    return (false);
  }
  Serial1.println("meFDCAN_init: HAL_FDCAN_Start OK"); // Add this
  return (true);
} //---------       END of Init

/*****************
 *
 *   RECEIVE
 *
 *****************/

int meFDCAN_receive(uint32_t *id, uint8_t *len, uint8_t rxData[], int canPort, int *type, int fifo)
{
  FDCAN_HandleTypeDef *fdcan = canPortHandle(canPort);
  if (fdcan == NULL)
    return (-1);
  uint32_t _fifo = FDCAN_RX_FIFO0;
  if (fifo == 1)
    _fifo = FDCAN_RX_FIFO1;
  int lvl = (int)HAL_FDCAN_GetRxFifoFillLevel(fdcan, _fifo);
  if (lvl == 0)
    return (lvl);

  FDCAN_RxHeaderTypeDef rxHeader;
  if (HAL_FDCAN_GetRxMessage(fdcan, _fifo, &rxHeader, rxData) != HAL_OK)
    return (-1);
  *id = rxHeader.Identifier;
  if (type != nullptr)
  {
    if (rxHeader.IdType == FDCAN_STANDARD_ID)
      *type = 1;
    if (rxHeader.IdType == FDCAN_EXTENDED_ID)
      *type = -1;
  }
  // if (rxHeader.IdType != FDCAN_STANDARD_ID) {return -2;}
  //*len = rxDataLength(rxHeader.DataLength);

  *len = rxDataLengthFD(rxHeader.DataLength, false);
  return (lvl);
}

/****************************
 *
 *       Transmit
 *
 ****************************/

bool meFDCAN_transmit(int txId, uint8_t *txData, int canPort, int len)
{
  FDCAN_HandleTypeDef *fdcan = canPortHandle(canPort);
  if (fdcan == NULL)
    return (false);
  bool success = true;
  uint32_t dlc = int_to_fdcan_dlc(len);
  FDCAN_TxHeaderTypeDef TxHeader;
  TxHeader.Identifier = txId;
  TxHeader.IdType = FDCAN_STANDARD_ID;
  TxHeader.TxFrameType = FDCAN_DATA_FRAME;
  TxHeader.DataLength = dlc;
  TxHeader.ErrorStateIndicator = FDCAN_ESI_ACTIVE;
  TxHeader.BitRateSwitch = FDCAN_BRS_OFF;
  TxHeader.FDFormat = FDCAN_CLASSIC_CAN;
  TxHeader.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
  TxHeader.MessageMarker = 0;
  if (HAL_FDCAN_AddMessageToTxFifoQ(fdcan, &TxHeader, txData) != HAL_OK)
  {
    success = false;
  }
  return (success);
}
/*************************************************************************************
 *                                  Filter Functions
 *************************************************************************************/

int me_FDCAN_addFilter(uint32_t id1, uint32_t id2, uint32_t filtertype, int canPort)
{
  meFDCAN_stdFilter filter;
  filter.filterindex = 0;
  filter.id1 = id1;
  filter.id2 = id2;
  filter.filtertype = filtertype;
  return canFilters.addFilter(canPort, filter);
}

bool meFDCAN_setupFilters(int canPort)
{
  if (canPort < 1 || canPort > 3)
    return false;
  if (!canFilters.isFilter(canPort))
    return (true);
  while (1)
  {
    meFDCAN_stdFilter filter = canFilters.nextFilter(canPort);
    if (filter.filter == false)
      break;
    bool ans = meFDCAN_addConfigFilter(canPort, &filter);
    if (!ans)
    {
      return (false);
    }
  }
  HAL_StatusTypeDef result;
  FDCAN_HandleTypeDef *fdcan = canPortHandle(canPort);
  result = HAL_FDCAN_ConfigGlobalFilter(fdcan, FDCAN_REJECT, FDCAN_REJECT, FDCAN_REJECT_REMOTE, FDCAN_REJECT_REMOTE);
  if (result != HAL_OK)
  {
    return (false);
  }
  return (true);
}

bool meFDCAN_addConfigFilter(int canPort, meFDCAN_stdFilter *mefilter)
{
  FDCAN_HandleTypeDef *fdcan = canPortHandle(canPort);
  FDCAN_FilterTypeDef filter_config;
  filter_config.IdType = FDCAN_STANDARD_ID;
  filter_config.FilterIndex = mefilter->filterindex;
  filter_config.FilterType = mefilter->filtertype;
  filter_config.FilterConfig = FDCAN_FILTER_TO_RXFIFO0;
  filter_config.FilterID1 = mefilter->id1;
  filter_config.FilterID2 = mefilter->id2;
  if (HAL_FDCAN_ConfigFilter(fdcan, &filter_config) != HAL_OK)
  {
    // handle error
    Serial1.println("BAD FILTER 2");
    return (false);
  }
  return (true);
}

/**********************************************************
 *                 Interrupts
 **********************************************************/

bool me_FDCAN_setRxInterrupt(int canPort, int fifo)
{
  IRQn_Type irq;
  FDCAN_HandleTypeDef *fdcan = canPortHandle(canPort);
  if (fdcan == NULL)
    return (false);
  bool success = true;
  uint32_t _fifo = FDCAN_RX_FIFO0;
  if (fifo == 1)
    _fifo = FDCAN_RX_FIFO1;
  if (HAL_FDCAN_ActivateNotification(fdcan, FDCAN_IT_RX_FIFO0_NEW_MESSAGE, 0) != HAL_OK)
  {
    return (false);
  }
  if (canPort == 1)
  {
    irq = FDCAN1_IT0_IRQn;
  }
  // if (canPort == 2)
  // {
  //   irq = FDCAN2_IT0_IRQn;
  // }
  // if (canPort == 3)
  // {
  //   irq = FDCAN3_IT0_IRQn;
  // }

  /* Enable FDCAN IRQ */
  HAL_NVIC_SetPriority(irq, 0, 0);
  HAL_NVIC_EnableIRQ(irq);
  return (true);
}

/****************************************************
 *                  Misc
 ****************************************************/

FDCAN_HandleTypeDef *canPortHandle(int canPort)
{
  FDCAN_HandleTypeDef *fdcan = NULL;

