marius9043/STM32G431CB_FDCAN/meFDCAN.h
  switch (canPort)
  {
  case 1:
    fdcan = &hfdcan1;
    break;
    // case 2:
    //   fdcan = &hfdcan2;
    //   break;
    // case 3:
    //   fdcan = &hfdcan3;
    //   break;
  }
  return fdcan;
}

int meFDCAN_Port(FDCAN_HandleTypeDef *fdcan)
{
  if (fdcan->Instance == FDCAN1)
  {
    return (1);
  }
  // if (fdcan->Instance == FDCAN2)
  // {
  //   return (2);
  // }
  // if (fdcan->Instance == FDCAN3)
  // {
  //   return (3);
  // }
}

bool setupFDCANpin(int _pin)
{
  bool success = true;
  GPIO_InitTypeDef gpio_init;
  Serial1.print("setupFDCANpin: Attempting to configure pin: ");
  Serial1.println(_pin); // Print the raw integer value of the pin

  switch (_SERIES)
  {
  case PROC_G4:
    switch (_pin)
    {
    //  CAN1
    case PA11: // rx
      Serial1.println("setupFDCANpin: Matched PA11.");
      __HAL_RCC_GPIOA_CLK_ENABLE();
      gpio_init.Pin = GPIO_PIN_11;
      gpio_init.Mode = GPIO_MODE_AF_PP;
      gpio_init.Pull = GPIO_NOPULL;
      gpio_init.Speed = GPIO_SPEED_FREQ_HIGH;
      gpio_init.Alternate = GPIO_AF9_FDCAN1;
      HAL_GPIO_Init(GPIOA, &gpio_init);
      break;
    case PA12: // tx
      Serial1.println("setupFDCANpin: Matched PA12.");
      __HAL_RCC_GPIOA_CLK_ENABLE();
      gpio_init.Pin = GPIO_PIN_12;
      gpio_init.Mode = GPIO_MODE_AF_PP;
      gpio_init.Pull = GPIO_NOPULL;
      gpio_init.Speed = GPIO_SPEED_FREQ_HIGH;
      gpio_init.Alternate = GPIO_AF9_FDCAN1;
      HAL_GPIO_Init(GPIOA, &gpio_init);
      break;
    case PB8: // rx
      Serial1.println("setupFDCANpin: Matched PB8.");
      __HAL_RCC_GPIOB_CLK_ENABLE();
      gpio_init.Pin = GPIO_PIN_8;
      gpio_init.Mode = GPIO_MODE_AF_PP;
      gpio_init.Pull = GPIO_NOPULL;
      gpio_init.Speed = GPIO_SPEED_FREQ_HIGH;
      gpio_init.Alternate = GPIO_AF9_FDCAN1;
      HAL_GPIO_Init(GPIOB, &gpio_init);
      break;
    case PB9: // tx
      Serial1.println("setupFDCANpin: Matched PB9.");
      __HAL_RCC_GPIOB_CLK_ENABLE();
      gpio_init.Pin = GPIO_PIN_9;
      gpio_init.Mode = GPIO_MODE_AF_PP;
      gpio_init.Pull = GPIO_NOPULL;
      gpio_init.Speed = GPIO_SPEED_FREQ_HIGH;
      gpio_init.Alternate = GPIO_AF9_FDCAN1;
      HAL_GPIO_Init(GPIOB, &gpio_init);
      break;
    case 49: // PD0 // rx
      Serial1.println("setupFDCANpin: Matched PD0 (49).");
      __HAL_RCC_GPIOD_CLK_ENABLE();
      gpio_init.Pin = GPIO_PIN_0;
      gpio_init.Mode = GPIO_MODE_AF_PP;
      gpio_init.Pull = GPIO_NOPULL;
      gpio_init.Speed = GPIO_SPEED_FREQ_HIGH;
      gpio_init.Alternate = GPIO_AF9_FDCAN1;
      HAL_GPIO_Init(GPIOD, &gpio_init);
      break;
    case 50: // PD1 // tx
      Serial1.println("setupFDCANpin: Matched PD1 (50).");
      __HAL_RCC_GPIOD_CLK_ENABLE();
      gpio_init.Pin = GPIO_PIN_1;
      gpio_init.Mode = GPIO_MODE_AF_PP;
      gpio_init.Pull = GPIO_NOPULL;
      gpio_init.Speed = GPIO_SPEED_FREQ_HIGH;
      gpio_init.Alternate = GPIO_AF9_FDCAN1;
      HAL_GPIO_Init(GPIOD, &gpio_init);
      break;

      // case PB5: // CAN2  rx
      //   __HAL_RCC_GPIOB_CLK_ENABLE();
      //   gpio_init.Pin = GPIO_PIN_5;
      //   gpio_init.Mode = GPIO_MODE_AF_PP;
      //   gpio_init.Pull = GPIO_NOPULL;
      //   gpio_init.Speed = GPIO_SPEED_FREQ_HIGH;
      //   gpio_init.Alternate = GPIO_AF9_FDCAN2;
      //   HAL_GPIO_Init(GPIOB, &gpio_init);
      //   break;
      // case PB6: // CAN2  tx
      //   __HAL_RCC_GPIOB_CLK_ENABLE();
      //   gpio_init.Pin = GPIO_PIN_6;
      //   gpio_init.Mode = GPIO_MODE_AF_PP;
      //   gpio_init.Pull = GPIO_NOPULL;
      //   gpio_init.Speed = GPIO_SPEED_FREQ_HIGH;
      //   gpio_init.Alternate = GPIO_AF9_FDCAN2;
      //   HAL_GPIO_Init(GPIOB, &gpio_init);
      //   break;
      // case PB12: // CAN2  rx
      //   __HAL_RCC_GPIOB_CLK_ENABLE();
      //   gpio_init.Pin = GPIO_PIN_12;
      //   gpio_init.Mode = GPIO_MODE_AF_PP;
      //   gpio_init.Pull = GPIO_NOPULL;
      //   gpio_init.Speed = GPIO_SPEED_FREQ_HIGH;
      //   gpio_init.Alternate = GPIO_AF9_FDCAN2;
      //   HAL_GPIO_Init(GPIOB, &gpio_init);
      //   break;
      // case PB13: // CAN2  tx
      //   __HAL_RCC_GPIOB_CLK_ENABLE();
      //   gpio_init.Pin = GPIO_PIN_13;
      //   gpio_init.Mode = GPIO_MODE_AF_PP;
      //   gpio_init.Pull = GPIO_NOPULL;
      //   gpio_init.Speed = GPIO_SPEED_FREQ_HIGH;
      //   gpio_init.Alternate = GPIO_AF9_FDCAN2;
      //   HAL_GPIO_Init(GPIOB, &gpio_init);
      //   break;
      // case PA8: // CAN3 rx
      //   __HAL_RCC_GPIOA_CLK_ENABLE();
      //   gpio_init.Pin = GPIO_PIN_8;
      //   gpio_init.Mode = GPIO_MODE_AF_PP;
      //   gpio_init.Pull = GPIO_NOPULL;
      //   gpio_init.Speed = GPIO_SPEED_FREQ_HIGH;
      //   gpio_init.Alternate = GPIO_AF11_FDCAN3;
      //   HAL_GPIO_Init(GPIOA, &gpio_init);
      //   break;
      // case PA15: // CAN3 tx
      //   __HAL_RCC_GPIOA_CLK_ENABLE();
      //   gpio_init.Pin = GPIO_PIN_15;
      //   gpio_init.Mode = GPIO_MODE_AF_PP;
      //   gpio_init.Pull = GPIO_NOPULL;
      //   gpio_init.Speed = GPIO_SPEED_FREQ_HIGH;
      //   gpio_init.Alternate = GPIO_AF11_FDCAN3;
      //   HAL_GPIO_Init(GPIOA, &gpio_init);
      //   break;
      // case PB3: // CAN3 rx
      //   __HAL_RCC_GPIOB_CLK_ENABLE();
      //   gpio_init.Pin = GPIO_PIN_3;
      //   gpio_init.Mode = GPIO_MODE_AF_PP;
      //   gpio_init.Pull = GPIO_NOPULL;
      //   gpio_init.Speed = GPIO_SPEED_FREQ_HIGH;
      //   gpio_init.Alternate = GPIO_AF11_FDCAN3;
      //   HAL_GPIO_Init(GPIOB, &gpio_init);
      //   break;
      // case PB4: // CAN3 tx
      //   __HAL_RCC_GPIOB_CLK_ENABLE();
      //   gpio_init.Pin = GPIO_PIN_4;
      //   gpio_init.Mode = GPIO_MODE_AF_PP;
      //   gpio_init.Pull = GPIO_NOPULL;
      //   gpio_init.Speed = GPIO_SPEED_FREQ_HIGH;
      //   gpio_init.Alternate = GPIO_AF11_FDCAN3;
      //   HAL_GPIO_Init(GPIOB, &gpio_init);
      //   break;

    default:
      Serial1.print("setupFDCANpin: Pin ");
      Serial1.print(_pin);
      Serial1.println(" not matched to a known FDCAN pin for G4 series.");
      success = false;
      break;
    }
    break;
  default:
    Serial1.print("setupFDCANpin: Unknown processor series: ");
    Serial1.println(_SERIES);
    success = false;
    break;
  }
  Serial1.print("setupFDCANpin: Returning ");
  Serial1.println(success);
  return (success);
}

int findCanSettings(int _clock, int _bitRate)
{
  for (int i = 0; i < (sizeof(brSettings) / sizeof(bitRateSetting)); i++)
  {
    if (brSettings[i].Clock != _clock || brSettings[i].bitrate != _bitRate)
    {
      continue;
    }
    canSetting.prescale = brSettings[i].prescale;
    canSetting.Seg1 = brSettings[i].Seg1;
    canSetting.Seg2 = brSettings[i].Seg2;
    return i;
  }
  return -1;
}

uint8_t rxDataLengthFD(uint32_t _data_length, bool FD)
{
  union DataLength
  {
    uint32_t value;
    struct
    {
      uint16_t ignored_bits;
      uint8_t data_length : 4;
      uint8_t ignored : 4;
    } classic;
    struct
    {
      uint16_t ignored_bits;
      uint8_t data_length : 3;
      uint8_t FD : 1;
      uint8_t ignored : 4;
    } FD;
  };

  DataLength dataLength;
  dataLength.value = _data_length;

  uint8_t len = dataLength.classic.data_length;
  if (len > 8)
    len = 8;

  if (FD && dataLength.classic.data_length > 8)
  {
    switch (dataLength.FD.data_length)
    {
    case 1:
      len = 12;
      break;
    case 2:
      len = 16;
      break;
    case 3:
      len = 20;
      break;
    case 4:
      len = 24;
      break;
    case 5:
      len = 32;
      break;
    case 6:
      len = 48;
      break;
    case 7:
      len = 64;
      break;
    default:
      break;
    }
  }

  return len;
}

uint32_t int_to_fdcan_dlc(int dlc)
{
  switch (dlc)
  {
  case 0:
    return FDCAN_DLC_BYTES_0;
  case 1:
    return FDCAN_DLC_BYTES_1;
  case 2:
    return FDCAN_DLC_BYTES_2;
  case 3:
    return FDCAN_DLC_BYTES_3;
  case 4:
    return FDCAN_DLC_BYTES_4;
  case 5:
    return FDCAN_DLC_BYTES_5;
  case 6:
    return FDCAN_DLC_BYTES_6;
  case 7:
    return FDCAN_DLC_BYTES_7;
  case 8:
    return FDCAN_DLC_BYTES_8;
  case 12:
    return FDCAN_DLC_BYTES_12;
  case 16:
    return FDCAN_DLC_BYTES_16;
  case 20:
    return FDCAN_DLC_BYTES_20;
  case 24:
    return FDCAN_DLC_BYTES_24;
  case 32:
    return FDCAN_DLC_BYTES_32;
  case 48:
    return FDCAN_DLC_BYTES_48;
  case 64:
    return FDCAN_DLC_BYTES_64;
  default:
    return FDCAN_DLC_BYTES_0;
  }
}
